{"weightsManifest": [{"paths": ["group1-shard1of13", "group1-shard2of13", "group1-shard3of13", "group1-shard4of13", "group1-shard5of13", "group1-shard6of13", "group1-shard7of13", "group1-shard8of13", "group1-shard9of13", "group1-shard10of13", "group1-shard11of13", "group1-shard12of13", "group1-shard13of13"], "weights": [{"name": "batch_normalization_10/gamma", "shape": [2000], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [2000], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [2000], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [2000], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [40], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [40], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [160], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [160], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [2000], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [2000], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [2000], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [2000], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [5, 5, 3, 40], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [40], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [5, 5, 40, 80], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [80], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [5, 5, 80, 160], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [160], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [1440, 2000], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [2000], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [2000, 2000], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [2000], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [2000, 3036], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [3036], "dtype": "float32"}, {"name": "p_re_lu_10/alpha", "shape": [2000], "dtype": "float32"}, {"name": "p_re_lu_6/alpha", "shape": [28, 28, 40], "dtype": "float32"}, {"name": "p_re_lu_7/alpha", "shape": [14, 14, 80], "dtype": "float32"}, {"name": "p_re_lu_8/alpha", "shape": [7, 7, 160], "dtype": "float32"}, {"name": "p_re_lu_9/alpha", "shape": [2000], "dtype": "float32"}]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.2.2", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "bias_constraint": null, "filters": 40, "activity_regularizer": null, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [5, 5], "batch_input_shape": [null, 28, 28, 3], "kernel_regularizer": null, "name": "conv2d_4", "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 4}}, "data_format": "channels_last", "activation": "linear", "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_6", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "PReLU", "config": {"shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "alpha_regularizer": null, "name": "p_re_lu_6", "alpha_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_6", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "bias_constraint": null, "filters": 80, "strides": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_5", "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 4}}, "data_format": "channels_last", "activation": "linear", "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_7", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "PReLU", "config": {"shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "alpha_regularizer": null, "name": "p_re_lu_7", "alpha_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_5", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_7", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "bias_constraint": null, "filters": 160, "strides": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_6", "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 4}}, "data_format": "channels_last", "activation": "linear", "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_8", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "PReLU", "config": {"shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "alpha_regularizer": null, "name": "p_re_lu_8", "alpha_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_6", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.3, "name": "dropout_8", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_4", "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 4}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 2000, "trainable": true, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_9", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "PReLU", "config": {"shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "alpha_regularizer": null, "name": "p_re_lu_9", "alpha_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_9", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_5", "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 4}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 2000, "trainable": true, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_10", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "PReLU", "config": {"shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "alpha_regularizer": null, "name": "p_re_lu_10", "alpha_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_10", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_6", "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 4}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 3036, "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "softmax"}}]}}}